2020.07.24

In [24]:
import pandas as pd

In [25]:
df = pd.read_csv('pandas_data\\student.csv')
df

    이름  나이            주소
0  강경미  30  경기도 고양시 일산동구
1  고길동  20   서울시 노원구 상계동
2  개나리  19   서울시 강남구 역삼동

In [26]:
type(df)

pandas.core.frame.DataFrame

In [27]:
type(df.이름)

pandas.core.series.Series

In [28]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : None
python           : 3.7.6.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
machine          : AMD64
processor        : Intel64 Family 6 Model 58 Stepping 9, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : None.None

pandas           : 1.0.1
numpy            : 1.18.1
pytz             : 2019.3
dateutil         : 2.8.1
pip              : 20.0.2
setuptools       : 45.2.0.post20200210
Cython           : 0.29.15
pytest           : 5.3.5
hypothesis       : 5.5.4
sphinx           : 2.4.0
blosc            : None
feather          : None
xlsxwriter       : 1.2.7
lxml.etree       : 4.5.0
html5lib         : 1.0.1
pymysql          : None
psycopg2         : None
jinja2           : 2.11.1
IPython          : 7.12.0
pandas_datareader: None
bs4              : 4.8.2
bottleneck       : 1.3.2
fastparquet      : None
gcsfs            : None
lxml.etree       : 4.5.0
matplotlib       : 3.1.3
numexpr          : 2.7.1
odfpy            : None
openpyxl         : 3.0.3
pandas_gbq       : None
pyarrow          : None
pytables         : None
pytest           : 5.3.5
pyxlsb           : None
s3fs             : None
scipy            : 1.4.1
sqlalchemy       : 1.3.13
tables           : 3.6.1
tabulate         : None
xarray           : None
xlrd             : 1.2.0
xlwt             : 1.3.0
xlsxwriter       : 1.2.7
numba            : 0.48.0

In [31]:
df.head() # default 5개

    이름  나이            주소
0  강경미  30  경기도 고양시 일산동구
1  고길동  20   서울시 노원구 상계동
2  개나리  19   서울시 강남구 역삼동

In [32]:
df.tail()

    이름  나이            주소
0  강경미  30  경기도 고양시 일산동구
1  고길동  20   서울시 노원구 상계동
2  개나리  19   서울시 강남구 역삼동

In [33]:
df.head(n=2)

    이름  나이            주소
0  강경미  30  경기도 고양시 일산동구
1  고길동  20   서울시 노원구 상계동

In [34]:
df.tail(1)

    이름  나이           주소
2  개나리  19  서울시 강남구 역삼동

In [36]:
df = pd.read_csv('pandas_data\student_tab.txt')
df

              이름\t나이\t주소
0  강경미\t30\t경기도 고양시 일산동구
1   고길동\t20\t서울시 노원구 상계동
2   개나리\t19\t서울시 강남구 역삼동

#### delimiter option

In [38]:
df = pd.read_csv('pandas_data\student_tab.txt',delimiter = '\t')
df

    이름  나이            주소
0  강경미  30  경기도 고양시 일산동구
1  고길동  20   서울시 노원구 상계동
2  개나리  19   서울시 강남구 역삼동

In [40]:
df = pd.read_csv('pandas_data\student_data.txt')
df

   Unnamed: 0  name  age       address
0           0  kang   30  경기도 고양시 일산동구
1           1   kim   23   서울시 강남구 역삼동
2           2  hong   22    서울시 양천구 목동
3           3   lee   31  서울시 영등포구 양평동
4           4   hhh   27   서울시 노원구 상계동

#### header option

In [43]:
df = pd.read_csv('pandas_data\student_data.txt', header=None)
df

     0     1    2             3
0  NaN  name  age       address
1  0.0  kang   30  경기도 고양시 일산동구
2  1.0   kim   23   서울시 강남구 역삼동
3  2.0  hong   22    서울시 양천구 목동
4  3.0   lee   31  서울시 영등포구 양평동
5  4.0   hhh   27   서울시 노원구 상계동

In [45]:
df = pd.read_csv('pandas_data\student_data.txt')
df.columns=['순서','이름','나이','주소']
df

   순서    이름  나이            주소
0   0  kang  30  경기도 고양시 일산동구
1   1   kim  23   서울시 강남구 역삼동
2   2  hong  22    서울시 양천구 목동
3   3   lee  31  서울시 영등포구 양평동
4   4   hhh  27   서울시 노원구 상계동

## Series - pandas 가 제공하는 객체
- **`numpy`의 `ndarray`를 기반으로 인덱싱을 추가한 1차원 배열**
- 인덱스를 지정하지 않으면, 기본적으로 ndarray와 같이 -부터 시작하는 인덱스를 생성, 지정할 경우 명시적으로 지정된 index를 사용
- 같은 타입의 0개 이상의 데이터를 가질 수 있다.


https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html

In [48]:
# series 생성
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [49]:
pd.Series(['a','b','c'])

0    a
1    b
2    c
dtype: object